app/controllers/report_controller.rb

  def index
  #  @report = Report.all
    puts 'index has been initiated'
    render json: Report.all
---
SELECT "reports".* FROM "reports"

  def create
    #report = Timereport.create(name: "hej", project: 1, time: 8, text: "trollboll" )
    @report = Timereport.create(name: params[:name], project: params[:project], time: params[:time], text: params[:text])
---
INSERT INTO "timereports" ("name", "project", "time", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "hej"], ["project", 1], ["time", 8], ["text", "trollboll"], ["created_at", "2015-05-06 11:28:48.841659"], ["updated_at", "2015-05-06 11:28:48.841659"]]

  def show
    data = Timereport.all
---
SELECT "timereports".* FROM "timereports"

  def delete
    puts params[:id]
    @report = Timereport.find(params[:id]).destroy
---
DELETE FROM "timereports" WHERE "timereports"."id" = ?  [["id", 3]]
SELECT  "timereports".* FROM "timereports" WHERE "timereports"."id" = ? LIMIT 1  [["id", nil]]